#!/usr/bin/env python3
# -*- coding: utf-8 -*-
"""
Created on Mon Jan 20 11:29:21 2020

@author: nia
"""

#filename: hw_2_1.py
#Создать программу, решающую квадратное уравнение вида $$ {ax^2}+bx+c=0 $$
#Формула для корней квадратного уравления:¶
#$$ {x}_{1,2}=\frac{-b\pm\sqrt{b^2-4ac}}{2a} $$
#Пользователь должен по очереди ввести коэфициенты a,b,c.
#Если уравнение не имеет вещественных решений - вывести сообщение на экран и показать комплексные корни уравнения.
#Если уравнение имеет только один корень (вещественное число), то вывести сообщение об этом и показать значение.
#Если уравнение имеет два корня (вещественных чисел), то вывести сообщение об этом и показать оба значения.
#Необходимо обязательно вычислять и использовать Дискиминант.

# введення змінних

a=input('Enter the variable a :')
a=(float(a))
b=input('Enter the variable b :')
b=(float(b))
c=input('Enter the variable c :')
c=(float(c))
print('a= %s,b= %s, c= %s' % (a,b,c ))

# знаходимо квадратне рівняння
#a*x^2+b*x+c=0
#x^2+x=-1/a-1/b-c

#знаходимо дискримінант
d=((b**2)-(4*a*c))
print ('d= ',d)

# знаходимо корні рівняння якщо d>0
x1=0
x2=0

if d>0:
    x1=(-b+d**(1/2))/(2*a) 
    x2=(-b-d**(1/2))/(2*a)
    print ('Pівняння має два корення x1= %s, x2= %s' % (x1, x2))
elif d<0:
    x1=(-b+d**(1/2))/(2*a) 
    x2=(-b-d**(1/2))/(2*a)

    print ('''Pівняння має два комплексних кореня x1= %s, x2= %s'.
       Рівняння не має дійсних коренів.''' % (x1, x2))
else:
    x1=x2=(-b)/(2*a)
    print('Рівняння має один корінь х= ', x2)


