#!/usr/bin/env python3
# -*- coding: utf-8 -*-
"""
Created on Thu Jan 30 23:19:25 2020

@author: nia
"""

lambda-функции и их использование¶
Синтаксис¶
lambda <перечень параметров через запятую>: <блок кода>
Типовое использование¶
как аргумент функции, например map(func, *iterables) --> map object


In [31]:



def handler(x):
    return f"{x:2.2f} ^ 2 = {x ** 2:2.4f}, sqrt({x:2.2f}) = {x ** (1/2):2.4f}"

print(type(handler), id(handler))

l = list(range(10))

m = map(handler, l)
print(type(m), str(m), repr(m))

for formated_str in m:
    print(formated_str)






<class 'function'> 139853397834208
<class 'map'> <map object at 0x7f32281e9c10> <map object at 0x7f32281e9c10>
0.00 ^ 2 = 0.0000, sqrt(0.00) = 0.0000
1.00 ^ 2 = 1.0000, sqrt(1.00) = 1.0000
2.00 ^ 2 = 4.0000, sqrt(2.00) = 1.4142
3.00 ^ 2 = 9.0000, sqrt(3.00) = 1.7321
4.00 ^ 2 = 16.0000, sqrt(4.00) = 2.0000
5.00 ^ 2 = 25.0000, sqrt(5.00) = 2.2361
6.00 ^ 2 = 36.0000, sqrt(6.00) = 2.4495
7.00 ^ 2 = 49.0000, sqrt(7.00) = 2.6458
8.00 ^ 2 = 64.0000, sqrt(8.00) = 2.8284
9.00 ^ 2 = 81.0000, sqrt(9.00) = 3.0000




In [32]:



l = list(range(10))
m = map(
    lambda x: f"{x:2.2f} ^ 2 = {x ** 2:2.4f}, sqrt({x:2.2f}) = {x ** (1/2):2.4f}", 
    l,
)
print(type(m), str(m), repr(m))
for formated_str in m:
    print(formated_str)






<class 'map'> <map object at 0x7f322819a3d0> <map object at 0x7f322819a3d0>
0.00 ^ 2 = 0.0000, sqrt(0.00) = 0.0000
1.00 ^ 2 = 1.0000, sqrt(1.00) = 1.0000
2.00 ^ 2 = 4.0000, sqrt(2.00) = 1.4142
3.00 ^ 2 = 9.0000, sqrt(3.00) = 1.7321
4.00 ^ 2 = 16.0000, sqrt(4.00) = 2.0000
5.00 ^ 2 = 25.0000, sqrt(5.00) = 2.2361
6.00 ^ 2 = 36.0000, sqrt(6.00) = 2.4495
7.00 ^ 2 = 49.0000, sqrt(7.00) = 2.6458
8.00 ^ 2 = 64.0000, sqrt(8.00) = 2.8284
9.00 ^ 2 = 81.0000, sqrt(9.00) = 3.0000




In [33]:



"""
f"
    {x:2.2f} ^ 2 = {x ** 2:2.4f}, 
    sqrt({x:2.2f}) = {x ** (1/2):2.4f}
", 
"""
print('\n'.join(map(
    lambda x: f"{x:2.2f} ^ 2 = {x ** 2:2.4f}, sqrt({x:2.2f}) = {x ** (1/2):2.4f}", 
    list(range(10)),
)))






0.00 ^ 2 = 0.0000, sqrt(0.00) = 0.0000
1.00 ^ 2 = 1.0000, sqrt(1.00) = 1.0000
2.00 ^ 2 = 4.0000, sqrt(2.00) = 1.4142
3.00 ^ 2 = 9.0000, sqrt(3.00) = 1.7321
4.00 ^ 2 = 16.0000, sqrt(4.00) = 2.0000
5.00 ^ 2 = 25.0000, sqrt(5.00) = 2.2361
6.00 ^ 2 = 36.0000, sqrt(6.00) = 2.4495
7.00 ^ 2 = 49.0000, sqrt(7.00) = 2.6458
8.00 ^ 2 = 64.0000, sqrt(8.00) = 2.8284
9.00 ^ 2 = 81.0000, sqrt(9.00) = 3.0000
